&НаСервере
Процедура ВывестиДзНаФорму(ДеревоОбъект)

	// Создание Реквизита формы типа ДанныеФормыДерево
	МассивДобавляемыхРеквизитов = Новый Массив;
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Дерево", Новый ОписаниеТипов("ДеревоЗначений")));

	Для Каждого Колонка Из ДеревоОбъект.Колонки Цикл
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "Дерево"));
	КонецЦикла;

	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

	ЗначениеВРеквизитФормы(ДеревоОбъект, "Дерево");

	// Создание элемента формы типа ТаблицаФормы для отображения дерева
	ЭлементДерево = Элементы.Добавить("Дерево", Тип("ТаблицаФормы"));
	ЭлементДерево.ПутьКДанным = "Дерево";
	ЭлементДерево.Отображение = ОтображениеТаблицы.Дерево;

	Для Каждого Колонка Из ДеревоОбъект.Колонки Цикл

		НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"),ЭлементДерево);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Дерево." + Колонка.Имя;

	КонецЦикла;

КонецПроцедуры