стрПодключения = "Driver=[SQL Server];"
стрПодключения = стрПодключения + ИмяСервера + ";";
стрПодключения = стрПодключения + "Uid=" + ИмяПользователя + ";";
стрПодключения = стрПодключения + "Pwd=" + Пароль + ";";
стрПодключения = стрПодключения + "DataBase =" + ИмяБазы + ";";
стрПодключения = стрПодключения + "Pwd=" + Пароль + ";";

Connection = Новый COMОбъект(""ADODB.Connection"");

Connection.OpenServer = стрПодключения;

RS = Новый COMОбъект(""ADODB.Recordset"");

// Запрос к базе на языке SQL запросов.
RS.Open(""Select * from TradeUnit""; Connection);

Пока RS.EOF() = 0 Цикл

    // Можно обращаться и обрабатывать значения полей выборки.
    ИД = RS.Fields(""ID"").Value;
    Код = RS.Fields(""Code"").Value;

    // Обработка других полей
    //  ...

    RS.MoveNext();

КонецЦикла;

RS.Close();
Connection.Close();