Функция UUID_Timestamp(Ссылка)

	ГУИД = Ссылка.УникальныйИдентификатор();

    // Например ГУИД равен: bdb62d89-cede-11e4-b12b-d4ae52b5e909

    // Дата содержится в первых символах, bdb62d89-cede-11e4 которые нужно переставить задом наперед: 11e4-cede-bdb62d89

    Строка16 = Сред(ГУИД, 15, 4) + Сред(ГУИД, 10, 4) + Сред(ГУИД, 1, 8);

    // Убираем "лишние" знаки "-"(тире).

    Строка16 = СтрЗаменить(Строка16, "-", "");

    // Убираем первый символ, так как в нем содержится версия стандарта (зашит в седьмой октет)

    Строка15 = Сред(Строка16, 2);

    // Получаем timestamp в 60 бит : 1E4 CEDE BDB6 2D89

    ЧислоСек = 0;

    Для Позиция = 1 По СтрДлина(Строка15) Цикл

        ЧислоСек = ЧислоСек + Найти("123456789abcdef",Сред(Строка15,Позиция,1))*Pow(16,СтрДлина(Строка15) - Позиция);

    КонецЦикла;

    ЧислоСек = ЧислоСек / 10000000;

    // Прибавляем к дате начала Григореанского календаря

    Возврат Дата(1582, 10, 15, 00, 00, 00) + ЧислоСек + СмещениеСтандартногоВремени() + СмещениеЛетнегоВремени();;

КонецФункции