Функция СведенияОВнешнейОбработке() Экспорт

	мМетаданные = ЭтотОбъект.Метаданные();

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработки<?"Отчет/Обработка", ВыборВарианта, "Отчет", "Отчет", "Обработка", "ДополнительнаяОбработка">();
	ПараметрыРегистрации.Версия = "<?"", ДатаВремя, "ДФ=dd.MM.yyyy">";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;

	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = мМетаданные.Синоним;
	Команда.Идентификатор = мМетаданные.Имя;
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Истина;

	Возврат ПараметрыРегистрации;

КонецФункции