#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает сведения о внешней обработке.
Функция СведенияОВнешнейОбработке() Экспорт

	ОбъектМетаданных = ЭтотОбъект.Метаданные();

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.2");
	ПараметрыРегистрации.Вид             = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма();
	ПараметрыРегистрации.Наименование    = ОбъектМетаданных.Синоним;
	ПараметрыРегистрации.Информация      = ?(ПустаяСтрока(ОбъектМетаданных.Комментарий), ОбъектМетаданных.Синоним, ОбъектМетаданных.Комментарий);
	ПараметрыРегистрации.Версия          = "1.0.0.0";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;

	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеПривилегированногоРежима();
	ПараметрыРегистрации.Разрешения.Добавить(Разрешение);

	ПараметрыРегистрации.Назначение.Добавить("Документ.ЗаказКлиента");

	КомандаПечати = ПараметрыРегистрации.Команды.Добавить();
	КомандаПечати.Идентификатор = ОбъектМетаданных.Имя;
	КомандаПечати.Представление = ОбъектМетаданных.Синоним;
	КомандаПечати.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	КомандаПечати.ПоказыватьОповещение = Ложь;
	КомандаПечати.Модификатор = "ПечатьMXL";

	Возврат ПараметрыРегистрации;

КонецФункции

#КонецОбласти

#Область Печать

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	ОбъектМетаданных = ЭтотОбъект.Метаданные();

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ОбъектМетаданных.Имя) Тогда
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент = СформироватьПечатнуюФорму(МассивОбъектов, ОбъектыПечати);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ОбъектМетаданных.Имя,
			ОбъектМетаданных.Синоним,
			ТабличныйДокумент);
	КонецЕсли;

	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);

КонецПроцедуры

Функция СформироватьПечатнуюФорму(МассивОбъектов, ОбъектыПечати) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	ОбъектМетаданных = ЭтотОбъект.Метаданные();

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ИмяМакета = "ПФ_MXL_Макет";
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_" + ОбъектМетаданных.Имя;

	Макет = ПолучитьМакет(ИмяМакета);

	ОбластьЗаголовок  = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументШапка.Ссылка КАК Ссылка,
	|	ДокументШапка.Номер КАК Номер,
	|	ДокументШапка.Дата КАК Дата,
	|   ДокументШапка.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.ЗаказКлиента КАК ДокументШапка
	|ГДЕ
	|	ДокументШапка.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументТЧ1.НомерСтроки КАК НомерСтроки,
	|	ДокументТЧ1.Номенклатура КАК Номенклатура,
	|	ДокументТЧ1.Цена КАК Цена,
	|	ДокументТЧ1.Сумма КАК Сумма,
	|	ДокументТЧ1.Количество КАК Количество,
	|	ДокументТЧ1.Номенклатура.ЕдиницаИзмерения КАК ЕдИзм,
	|	ДокументТЧ1.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ДокументТЧ1
	|ГДЕ
	|	ДокументТЧ1.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки";

	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	РезультатЗапросаПоДокументу = Запрос.ВыполнитьПакет();
	ВыборкаДокумент = РезультатЗапросаПоДокументу[0].Выбрать();
	РезультатТЧ = РезультатЗапросаПоДокументу[1].Выбрать();

	ПервыйДокумент = Истина;

	Пока ВыборкаДокумент.Следующий() Цикл

		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("Номер", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаДокумент.Номер, Ложь, Ложь));
		ПараметрыЗаполнения.Вставить("Дата", Формат(ВыборкаДокумент.Дата, "ДФ=dd.MM.yyyy"));

		//Если нужны ФИО
		Если ЗначениеЗаполнено(ВыборкаДокумент.Ответственный) Тогда
			ПараметрыЗаполнения.Вставить("ОтветственныйФИОРП", СклонениеПредставленийОбъектов.ПросклонятьПредставление(Строка(ВыборкаДокумент.Ответственный), 2, ВыборкаДокумент.Ответственный));
			ПараметрыЗаполнения.Вставить("ОтветственныйФИО", ФизическиеЛицаЗарплатаКадры.РасшифровкаПодписи(Строка(ВыборкаДокумент.Руководитель.ФизическоеЛицо)));
		КонецЕсли;

		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаДокумент);
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыЗаполнения);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьШапка);

		ОтборПоиска = Новый Структура ("Ссылка", ВыборкаДокумент.Ссылка);
		СуммаИтого = 0;
		НомерПП = 1;

		Пока РезультатТЧ.НайтиСледующий(ОтборПоиска) Цикл
			ПараметрыЗаполненияСтроки = Новый Структура;
			ПараметрыЗаполненияСтроки.Вставить("НомерПП", НомерПП);
			ОбластьСтрока.Параметры.Заполнить(РезультатТЧ);
			ОбластьСтрока.Параметры.Заполнить(ПараметрыЗаполненияСтроки);
			СуммаИтого = СуммаИтого + РезультатТЧ.Сумма;
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			НомерПП = НомерПП + 1;
		КонецЦикла;

		//Если нужны суммы
		ПараметрыЗаполнения.Вставить("СуммаИтого", СуммаИтого);
		ПараметрыЗаполнения.Вставить("СуммаИтогоПрописью", ЧислоПрописью(СуммаИтого,,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));

		ОбластьПодвал.Параметры.Заполнить(ВыборкаДокумент);
		ОбластьПодвал.Параметры.Заполнить(ПараметрыЗаполнения);
		ТабличныйДокумент.Вывести(ОбластьПодвал);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
														НомерСтрокиНачало,
														ОбъектыПечати,
														ВыборкаДокумент.Ссылка);

	КонецЦикла;

	ТабличныйДокумент.АвтоМасштаб = Истина;

	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

	Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли