Функция Ожидать(ВремяОжиданияВСекундах) Экспорт

    Если ВремяОжиданияВСекундах<> 0 Тогда

        НастройкиПрокси = Новый ИнтернетПрокси(Ложь);
        НастройкиПрокси.НеИспользоватьПроксиДляЛокальныхАдресов = Истина;
        НастройкиПрокси.НеИспользоватьПроксиДляАдресов.Добавить("127.0.0.0");

        Попытка
            Замыкание = Новый HTTPСоединение("127.0.0.0",,,,НастройкиПрокси,ВремяОжиданияВСекундах);
            Замыкание.Получить(Новый HTTPЗапрос());
        Исключение
            Возврат Неопределено;
        КонецПопытки;

    КонецЕсли;

КонецФункции