Функция ПолучитьТолькоЦифрыИзСтроки(Знач Стр, АрифметическиеЗнаки = Ложь) Экспорт
	
	Результат = "";
	СтрокаЧисел = "1234567890";
	Если АрифметическиеЗнаки Тогда
	    СтрокаЧисел = СтрокаЧисел + "+-*/";
	КонецЕсли; 
	ВсегоСимволов = СтрДлина(Стр);
	Для Сч = 1 По ВсегоСимволов Цикл
		ТекСимвол = Сред(Стр, Сч, 1);
		Если ТекСимвол = "." ИЛИ ТекСимвол = "," Тогда
			Если Сч < ВсегоСимволов И Найти(СтрокаЧисел, Сред(Стр, Сч+1, 1)) > 0 Тогда //если след.символ цифра
				Результат = Результат + ".";
			КонецЕсли;
		ИначеЕсли Найти(СтрокаЧисел, ТекСимвол) > 0 Тогда
			Результат = Результат + ТекСимвол;			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
