Функция ОбъектМодифицирован(Объект, ПроверятьТабличныеЧасти = Истина, ПроверятьСтандартные = Истина) Экспорт

    Ссылка = Объект.Ссылка;

    МетаданныеОбъекта = Ссылка.Метаданные();

    Для каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл

    Если Объект[Реквизит.Имя] <> Ссылка[Реквизит.Имя] Тогда

            Возврат Истина;

        КонецЕсли;

    КонецЦикла;

    Если ПроверятьСтандартные Тогда

        Для каждого Реквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл

            Если Объект[Реквизит.Имя] <> Ссылка[Реквизит.Имя] Тогда

                Возврат Истина;

            КонецЕсли;

        КонецЦикла;

    КонецЕсли;

    Если ПроверятьТабличныеЧасти Тогда

        Для каждого ТЧ Из МетаданныеОбъекта.ТабличныеЧасти Цикл

            Если Объект[ТЧ.Имя].Количество() <> Ссылка[ТЧ.Имя].Количество() Тогда

        Возврат Истина;

            КонецЕсли;

            Для Индекс = 0 По Объект[ТЧ.Имя].Количество()-1 Цикл

                ОбъектСтрокаТЧ = Объект[ТЧ.Имя][Индекс];

                СсылкаСтрокаТЧ = Ссылка[ТЧ.Имя][Индекс];

                Для каждого РеквизитТЧ Из ТЧ.Реквизиты Цикл

                    Если ОбъектСтрокаТЧ[РеквизитТЧ.Имя] <> СсылкаСтрокаТЧ[РеквизитТЧ.Имя] Тогда

                        Возврат Истина;

                    КонецЕсли;

                КонецЦикла;

            КонецЦикла;

        КонецЦикла;

    КонецЕсли;

    Возврат Ложь;

КонецФункции