#Область СозданиеЭлементовИРеквизитов

// блок процедур/функций для программной работы с формами

Функция ДобавитьЭлементФормы(Форма, Имя, ТипПоля = "ПолеФормы", ПараметрРодитель = Неопределено, ПараметрСледующийЭлемент = Неопределено) Экспорт

	Элементы = Форма.Элементы;
	СледующийЭлемент = ОпределитьЭлементФормы(Элементы, ПараметрСледующийЭлемент);
	ТипЭлемента	= ?(ТипЗнч(ТипПоля) = Тип("Строка"), Тип(ТипПоля), ТипПоля);
	Если СледующийЭлемент = Неопределено Тогда
		Родитель = ОпределитьЭлементФормы(Элементы, ПараметрРодитель);
		Если Родитель = Неопределено Тогда
			Родитель = Форма;
		КонецЕсли;
		НовыйЭлемент = Элементы.Добавить(Имя, ТипЭлемента, Родитель);
	Иначе
		НовыйЭлемент = Элементы.Вставить(Имя, ТипЭлемента, СледующийЭлемент.Родитель, СледующийЭлемент);
	КонецЕсли;

	Возврат НовыйЭлемент;

КонецФункции

Функция ОпределитьЭлементФормы(Элементы, Элемент) Экспорт

	Результат = Неопределено;
	Если ТипЗнч(Элемент) = Тип("Строка") Тогда
		Если НЕ ПустаяСтрока(Элемент) Тогда
			Результат = Элементы.Найти(Элемент);
		КонецЕсли;
	Иначе
		Результат = Элемент;
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция ВывестиРеквизит(Форма, Имя, ПутьКДанным = "",
		Родитель = Неопределено, СледующийЭлемент = Неопределено,
		ИмяТипа = "ПолеФормы", ИмяВида = "ПолеВвода") Экспорт

	НачалоИмени = СтрЗаменить(ПутьКДанным, "Объект", "");
	НачалоИмени = СтрЗаменить(НачалоИмени, ".", "");
	НовыйЭлемент = ДобавитьЭлементФормы(Форма, НачалоИмени + Имя, ИмяТипа, Родитель, СледующийЭлемент);
	НовыйЭлемент.ПутьКданным = ?(ПустаяСтрока(ПутьКДанным), "", ПутьКДанным + ".") + Имя;
	Если ИмяТипа = "ПолеФормы" Тогда
		НовыйЭлемент.Вид = ВидПоляФормы[ИмяВида];
	КонецЕсли;

	Возврат НовыйЭлемент;

КонецФункции

Функция ВывестиКоманду(Форма, Имя,
		Действие = "", Заголовок = "", Родитель = Неопределено,
		СледующийЭлемент = Неопределено, Свойства = Неопределено) Экспорт

	Команда = Форма.Команды.Добавить(Имя);
	Команда.Действие = ?(ПустаяСтрока(Действие), Имя, Действие);
	Команда.Заголовок = Заголовок;
	Если Свойства <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Команда, Свойства);
	КонецЕсли;
	НовыйЭлемент = ДобавитьЭлементФормы(Форма, Имя, "КнопкаФормы", Родитель, СледующийЭлемент);
	НовыйЭлемент.ИмяКоманды = Имя;

	Возврат НовыйЭлемент;

КонецФункции

Процедура ДобавитьРеквизит(Массив, Имя, Тип, Путь = "", Заголовок = "", СохраняемыеДанные = Ложь) Экспорт

	ТипРеквизита = ?(ТипЗнч(Тип) = Тип("Строка"), Новый ОписаниеТипов(Тип), Тип);
	Массив.Добавить(Новый РеквизитФормы(Имя, ТипРеквизита, Путь, Заголовок, СохраняемыеДанные));

КонецПроцедуры

Процедура СозданиеДинамическогоСписка(ЭтаФорма,
	ИмяСписка = "Список", 			 //тип строка - имя будущего списка на форме и реквизита
	ТекстЗапроса = "", 				 //тип строка - запрос, если он не указан, необходимо указать таблицу
	МассивКолонок,                   //тип массив - массив создаваемых колонок
	СписокДействий = Неопределено,   //тип структура - структура содержит действия (свойства) динамического списка
	ТаблицаСписка = "",				 //тип строка - содержит имя основной таблицы
	ДобавитьВ = "",                  //тип строка - имя элемента на который будет размещен список
	ВставитьПеред = "",              //тип строка - имя элемента перед которым будет размещен список
	СвояКоманднаяПанель = Ложь,      //тип булево - если Истина, скрывает стандартную панель
	ПараметрыЗапроса = Неопределено) Экспорт //тип структура - содержит перечень параметров

	Элементы = ЭтаФорма.Элементы;

	//Защита от дурака
	Если ТекстЗапроса = "" И ТаблицаСписка = "" Тогда
		Сообщить("Ошибка формирования динамического списка, укажите запрос или таблицу");
		Возврат;
	КонецЕсли;

	//Создаем свою командную панель
	Если СвояКоманднаяПанель Тогда
		Если ВставитьПеред = "" Тогда
			ГруппаДинамическогоСписка = Элементы.Добавить("Группа" + ИмяСписка + "CоСвоейКоманднойПанелью",
								Тип("ГруппаФормы"), ?(ДобавитьВ = "", ЭтаФорма, ЭтаФорма.Элементы[ДобавитьВ]));
		Иначе
			ГруппаДинамическогоСписка = Элементы.Вставить("Группа" + ИмяСписка + "CоСвоейКоманднойПанелью",
								Тип("ГруппаФормы"), ?(ДобавитьВ = "", ЭтаФорма, ЭтаФорма.Элементы[ДобавитьВ]), ЭтаФорма.Элементы[ВставитьПеред]);
		КонецЕсли;
		ГруппаДинамическогоСписка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаДинамическогоСписка.ОтображатьЗаголовок = Ложь;
		ГруппаДинамическогоСписка.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаДинамическогоСписка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		КоманднаяПанельСписка = Элементы.Добавить(ИмяСписка + "КоманднаяПанель2", Тип("ГруппаФормы"), ГруппаДинамическогоСписка);
		КоманднаяПанельСписка.Вид = ВидГруппыФормы.КоманднаяПанель;
	КонецЕсли;

	//Создаем реквизит формы
	ТипыРеквизита = Новый Массив;
	ТипыРеквизита.Добавить(Тип("ДинамическийСписок"));
	ОписаниеТиповДляРеквизита = Новый ОписаниеТипов(ТипыРеквизита);
	ДинамическийСписок = Новый РеквизитФормы(ИмяСписка, ОписаниеТиповДляРеквизита, , "", Ложь);
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(ДинамическийСписок);

	//Задаем свойства реквизиту
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	РеквизитДинамическийСписок = ЭтаФорма[ИмяСписка];
	Если ТекстЗапроса = "" Тогда
		РеквизитДинамическийСписок.ПроизвольныйЗапрос = Ложь;
		РеквизитДинамическийСписок.ОсновнаяТаблица = ТаблицаСписка;
	Иначе
		РеквизитДинамическийСписок.ПроизвольныйЗапрос = Истина;
		РеквизитДинамическийСписок.ТекстЗапроса = ТекстЗапроса;
		Если ТаблицаСписка <> "" Тогда
			РеквизитДинамическийСписок.ОсновнаяТаблица = ТаблицаСписка;
		КонецЕсли;
	КонецЕсли;

	//Заполняем параметры если они были указаны
	Если ПараметрыЗапроса <> Неопределено Тогда
		Для Каждого Параметр Из ПараметрыЗапроса Цикл
			РеквизитДинамическийСписок.Параметры.УстановитьЗначениеПараметра(Параметр.Ключ, Параметр.Значение);
		КонецЦикла;
	КонецЕсли;

	//Размещаем реквизит на форме
	Если Ложь
		ИЛИ ВставитьПеред = ""
		ИЛИ СвояКоманднаяПанель
		Тогда
		ТаблицаФормы = Элементы.Добавить(ИмяСписка, Тип("ТаблицаФормы"),
			?(СвояКоманднаяПанель, ГруппаДинамическогоСписка, ?(ДобавитьВ = "", ЭтаФорма, ЭтаФорма.Элементы[ДобавитьВ])));
	Иначе
		ТаблицаФормы = Элементы.Вставить(ИмяСписка, Тип("ТаблицаФормы"),
			?(ДобавитьВ = "", ЭтаФорма, ЭтаФорма.Элементы[ДобавитьВ]), ЭтаФорма.Элементы[ВставитьПеред]);
	КонецЕсли;
	ТаблицаФормы.ПутьКДанным = ИмяСписка;

	//Если своя панель тогда скрываем стандартную
	Если СвояКоманднаяПанель Тогда
		Элементы[ИмяСписка].ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	КонецЕсли;

	//Создание колонок на основание МассивКолонок
	Для Каждого Элемента Из МассивКолонок Цикл
		ПараметрыКолонки = СтрЗаменить(Элемента, ",", Символы.ПС);
		Если СтрЧислоСтрок(ПараметрыКолонки) > 1 Тогда
			Заголовок = СтрПолучитьСтроку(ПараметрыКолонки, 1);
			ИмяКолонки = СтрПолучитьСтроку(ПараметрыКолонки, 2);
		Иначе
			Заголовок = "";
			ИмяКолонки = ПараметрыКолонки;
		КонецЕсли;
		НоваяКолонкаТаблицы = Элементы.Добавить(ИмяСписка + ИмяКолонки, Тип("ПолеФормы"), ТаблицаФормы);
		Если Заголовок <> "" Тогда
			НоваяКолонкаТаблицы.Заголовок = Заголовок;
		КонецЕсли;
		НоваяКолонкаТаблицы.ПутьКДанным = ИмяСписка + "." + ИмяКолонки;
	КонецЦикла;

	//Задаем действия (События)
	Если СписокДействий <> Неопределено Тогда
		ПереченьСвойств = "ПриИзменении
						|Выбор
						|ПриАктивизацииСтроки
						|ВыборЗначения
						|ПриАктивизацииПоля
						|ПриАктивизацииЯчейки
						|ПередНачаломДобавления
						|ПередНачаломИзменения
						|ПередУдалением
						|ПриНачалеРедактирования
						|ПередОкончаниемРедактирования
						|ПриОкончанииРедактирования
						|ОбработкаВыбора
						|ПередРазворачиванием
						|ПередСворачиванием
						|ПослеУдаления
						|ПриСменеТекущегоРодителя
						|ОбработкаЗаписиНового
						|ПриСохраненииПользовательскихНастроекНаСервере
						|ПередЗагрузкойПользовательскихНастроекНаСервере
						|ПриЗагрузкеПользовательскихНастроекНаСервере
						|ПриОбновленииСоставаПользовательскихНастроекНаСервере
						|ОбработкаЗапросаОбновления
						|ПриПолученииДанныхНаСервере
						|НачалоПеретаскивания
						|ПроверкаПеретаскивания
						|ОкончаниеПеретаскивания
						|Перетаскивание";
		Для Счетчик = 1 по 28 Цикл
			ИмяСвойства = СтрПолучитьСтроку(ПереченьСвойств, Счетчик);
			Элементы[ИмяСписка].УстановитьДействие(ИмяСвойства, ?(СписокДействий.Свойство(ИмяСвойства), СписокДействий[ИмяСвойства], ""));
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти