Функция СжатьСтроку(СтрокаJSON)

	//Для СтрокаJSON длиной 1 000 000 байт
	//СтрокаBase64 имеет длину 36 000 байт

	СжатиеДанных = Новый СжатиеДанных(9);
	Значение = Новый ХранилищеЗначения(СтрокаJSON,СжатиеДанных);
	СтрокаBase64 = XMLСтрока(Значение);								//Преобразуем в Base64

	Возврат СтрокаBase64;

КонецФункции

Функция ВосстановитьСтроку(Стр)

	Результат = Стр;
	Хранилище = XMLЗначение(Тип("ХранилищеЗначения"), Стр);
	СтрокаJSONизХранилища = Хранилище.Получить();
	Если НЕ СтрокаJSONизХранилища = Неопределено Тогда		//  Исползовалось Сжатие через ХранилищеЗначения
		Результат = СтрокаJSONизХранилища;
	КонецЕсли;

	Возврат Результат;

КонецФункции