// Процедура сохраняет скриншот текущего сеанса пользователя по переданному адресу
// Работает начиная с версии 8.3.17.
//
// Параметры:
//  ПолныйПуть	 - Строка	 - Полный путь к файлу
//
&НаКлиенте
Процедура СохранитьСкриншотСеанса(ПолныйПуть = "")

	#Если НЕ ВебКлиент Тогда
	ВременныйФайл = ПолучитьИмяВременногоФайла(".zip");
	
	ОтчетОбОшибке = Новый ОтчетОбОшибке(ИнформацияОбОшибке());
	ОтчетОбОшибке.Записать(ВременныйФайл, Ложь);

	КаталогФайлов = КаталогВременныхФайлов() + СтрЗаменить(Новый УникальныйИдентификатор, "-", "");

	ЧтениеАрхива  = Новый ЧтениеZipФайла(ВременныйФайл);
	ЧтениеАрхива.ИзвлечьВсе(КаталогФайлов, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);

	ПутьСкриншота = КаталогФайлов + "\screenshot.png";

	КопироватьФайл(ПутьСкриншота, ПолныйПуть);
	УдалитьФайлы(ВременныйФайл);
	УдалитьФайлы(КаталогФайлов);
	#КонецЕсли

КонецПроцедуры