&НаСервере
Функция СравнитьХранилища(Хранилище1, Хранилище2)

    Если ТипЗнч(Хранилище1) = Тип("ХранилищеЗначения") Тогда
        ДвоичныеДанные1 = Хранилище1.Получить();
    ИначеЕсли ТипЗнч(Хранилище1) = Тип("ДвоичныеДанные") Тогда
        ДвоичныеДанные1 = Хранилище1;
    Иначе
        Возврат Неопределено;
    КонецЕсли;

    Если ТипЗнч(Хранилище2) = Тип("ХранилищеЗначения") Тогда
        ДвоичныеДанные2 = Хранилище2.Получить();
    ИначеЕсли ТипЗнч(Хранилище2) = Тип("ДвоичныеДанные") Тогда
        ДвоичныеДанные2 = Хранилище2;
    Иначе
        Возврат Неопределено;
    КонецЕсли;

    Если (ДвоичныеДанные1 = Неопределено ИЛИ ДвоичныеДанные2 = Неопределено)
        И НЕ (ДвоичныеДанные1 = Неопределено И ДвоичныеДанные2 = Неопределено) Тогда

        Возврат Ложь;

    КонецЕсли;

    Base64Строка1 = Base64Строка(ДвоичныеДанные1);
    Base64Строка2 = Base64Строка(ДвоичныеДанные2);

    Возврат Base64Строка1 = Base64Строка2;

КонецФункции