Функция ВывестиТаблицуЗначенийВТабличныйДокумент(ТаблицаЗначений)

	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	ИмяНабора = "Основной";
	Результат = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	Результат.Имя = ИмяНабора;
	Результат.ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных[0].Имя;
	Результат.ИмяОбъекта = ИмяНабора;

	Для Каждого ЭлементМетаданных Из ТаблицаЗначений.Колонки Цикл
		ИмяПоля = ЭлементМетаданных.Имя;
		ЗаголовокПоля = ЭлементМетаданных.Заголовок;
		Поле = Результат.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПутьКДанным = ИмяПоля;
		Поле.Поле = ИмяПоля;
		Поле.Заголовок = ЗаголовокПоля;
		Поле.ТипЗначения = ЭлементМетаданных.ТипЗначения;
	КонецЦикла;

	КомпоновщикНастроек_ = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек_.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		ЭлементНастроек = КомпоновщикНастроек_.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ЭлементНастроек.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
	КонецЦикла;

	//Добавление группировок, если есть БСП
	//КомпоновкаДанныхКлиентСервер.ДобавитьГруппировку(КомпоновщикНастроек_, "Подразделение");
	//	КомпоновкаДанныхКлиентСервер.ДобавитьГруппировку(КомпоновщикНастроек_, "Должность");
	КомпоновкаДанныхКлиентСервер.ДобавитьГруппировку(КомпоновщикНастроек_); //Детальные записи

	//Детальные записи без БСП
	//	мГруппировки = КомпоновщикНастроек_.Настройки.Структура;
	//	мГруппировка = мГруппировки.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	//	мГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	//	мГруппировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек_.ПолучитьНастройки());
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	мВнешниеНаборыДанных = Новый Структура("Основной", ТаблицаЗначений);
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, мВнешниеНаборыДанных);
	ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.УстановитьДокумент(ТабличныйДокумент);
	ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);

	Возврат ТабДок;

КонецФункции