&НаКлиенте
Процедура ПрочитатьФайл(Команда)

	НачатьПомещениеФайлаНаСервер(Новый ОписаниеОповещения("ПрочитатьФайлЗавершение", ЭтаФорма), , , , ИмяФайла, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайлЗавершение(ОписаниеПомещенногоФайла, ДопПараметры) Экспорт

	Если ОписаниеПомещенногоФайла <> Неопределено Тогда
		ПрочитатьФайлНаСервере(ОписаниеПомещенногоФайла.Адрес);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлНаСервере(АдресНаСервере)

	АдресФайлаИзВременногоХранилища = ПолучитьИзВременногоХранилища(АдресНаСервере);
    ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла("xlsx");
    АдресФайлаИзВременногоХранилища.Записать(ИмяПромежуточногоФайла);

    ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.Прочитать(ИмяПромежуточногоФайла, СпособЧтенияЗначенийТабличногоДокумента.Текст, ТипФайлаТабличногоДокумента.XLSX);

КонецПроцедуры